## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.inferno will be created
  + resource "helm_release" "inferno" {
      + atomic                     = false
      + chart                      = "../helm/inferno"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "dev-inferno"
      + namespace                  = "dev-inferno"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = true
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                externalDomain: "default.inferno.hl7.org.au"
                
                inferno:
                  imageUrl: "ghcr.io/hl7au/au-fhir-inferno:68270162fcc1997a9ffac63c78530921bf0f32cf"
                  terminologyServer: "https://tx.dev.hl7.org.au/fhir"
                  externalValidatorUrl: null  # This can be overridden during chart deployment
                
                controller:
                  enabled: false # Set to true to enable the ingress controller if you have not already installed it, multiple ingress controllers can be installed via https://kubernetes.github.io/ingress-nginx/user-guide/multiple-ingress/
                  ingressClass: "nginx"
                  ingressClassResource:
                    name: nginx
                    enabled: true
                    default: false
                  service:
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-type: "nlb"
                
                postgresql:
                  enabled: false # enable if not using rds from aws-impl
                  externaldbhost: null # This can be overridden during chart deployment
                  containerPorts:
                    postgresql: 5432
                  global:
                    postgresql:
                      auth:
                        username: "postgres"
                        password: "password"
                        database: "inferno"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.2.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "externalDomain"
          + value = "dev.inferno.hl7.org.au"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "inferno.imageUrl"
          + value = "ghcr.io/hl7au/au-fhir-inferno:10a03203c0e7219c95146190c69114db178d942c"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "nginx.platformImageUri"
          + value = "ghcr.io/hl7au/au-fhir-inferno:7a99baaf50e18e201e95f7ca91477bc41da0cda8-nginx"
            # (1 unchanged attribute hidden)
        }

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>